[
{"review": "<p class=\"partial_entry\">Attended a Tool concert here. If you wanna know if its worth it to come and attend a music concert at this venue, just one word of advice: Stay Away. The acoustics are terrible, if you are unfortunate enough to attend a rock concert here,...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"},
{"review": "<p class=\"partial_entry\">First hockey game ever. It was a lot of fun. Bring ear protection if you are senstive to noise and make sure you eat prior to going. The food is silly expensive and the beer was $15!</p>"},
{"review": "<p class=\"partial_entry\">What a great venue! Security wasn't as brutal as I expected. The show wasn't sold out, but we weren't sure how bad it would be since we're visitors from Toronto and we are used to heavy security at events this big.\n\nSeating is comfortable and...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"},
{"review": "<p class=\"partial_entry\">I very much like to have a great venue for any sport event. I am not a big fan to go there for a concert as I do not like the acoustic and sound there. But, the place is great, food is pricey but good...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"},
{"review": "<p class=\"partial_entry\">NYC Mamí has been hosted for a few events at the Barclay’s Center including a Nets Podcast and game, The Ringling Bros. Circus and a Harlem Globetrotters game.  They have so many shows for the whole family, concerts, and other events at this venue and...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"},
{"review": "<p class=\"partial_entry\">Great location with very good transport links. We have visited a few times now. Good food available. Watching a basketball game is always great fun with the family and adds a local experience to the vacation. Would definitely recommend</p>"},
{"review": "<p class=\"partial_entry\">Sec 211 Row 12 Seat 1. \nVery steep section so don’t bring your Grandparents.  Way too steep of a section for them to climb.  If you got heart issues or out of shape, don’t bother getting a seat in or around this section.  Wish I...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"},
{"review": "<p class=\"partial_entry\">This review is about Barclays Center as a music concert venue, rather than as a sports venue - which is obviously what it was originally designed and built for. Although I have attended only one concert there (Oct. 2019), I am very unlikely to ever...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"},
{"review": "<p class=\"partial_entry\">Went to watch the opening match of the Netts v the timberwolves in the NBA and saw a great match and with no pillars don’t think there’s a bad seat but selling cans of beer at $15 each and footlong hotdogs at $11 you see...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"},
{"review": "<p class=\"partial_entry\">Not sure why this gets such great reviews, it is a nice venue for concerts and games, and seats did seem close to the floor.  But don't go out of your way to visit it unless you have a show or game to watch.  Not...<span class=\"taLnk ulBlueLinks\" onclick=\"widgetEvCall('handlers.clickExpand',event,this);\">More</span></p>"}
]